{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>~\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "output_shape": null, "arguments": {}}}, {"class_name": "Cropping2D", "config": {"name": "cropping2d_1", "trainable": true, "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "nb_filter": 24, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_1", "b_regularizer": null, "nb_col": 5, "activation": "elu", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "nb_filter": 36, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_2", "b_regularizer": null, "nb_col": 5, "activation": "elu", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 5, "border_mode": "valid", "nb_filter": 48, "activity_regularizer": null, "subsample": [2, 2], "name": "convolution2d_3", "b_regularizer": null, "nb_col": 5, "activation": "elu", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "name": "convolution2d_4", "b_regularizer": null, "nb_col": 3, "activation": "elu", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 3, "border_mode": "valid", "nb_filter": 64, "activity_regularizer": null, "subsample": [1, 1], "name": "convolution2d_5", "b_regularizer": null, "nb_col": 3, "activation": "elu", "bias": true, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "trainable": true, "batch_input_shape": [null, 2112], "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "b_regularizer": null, "W_constraint": null, "input_dim": 2112, "activation": "elu", "bias": true, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 50, "trainable": true, "batch_input_shape": [null, 100], "activity_regularizer": null, "W_regularizer": null, "name": "dense_2", "b_regularizer": null, "W_constraint": null, "input_dim": 100, "activation": "elu", "bias": true, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 10, "trainable": true, "batch_input_shape": [null, 50], "activity_regularizer": null, "W_regularizer": null, "name": "dense_3", "b_regularizer": null, "W_constraint": null, "input_dim": 50, "activation": "elu", "bias": true, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "trainable": true, "batch_input_shape": [null, 10], "activity_regularizer": null, "W_regularizer": null, "name": "dense_4", "b_regularizer": null, "W_constraint": null, "input_dim": 10, "activation": "linear", "bias": true, "input_dtype": "float32", "init": "glorot_uniform", "b_constraint": null}}], "keras_version": "1.2.1"}