{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 160, 320, 3], "trainable": true, "output_shape_type": "raw", "output_shape": null, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>\u0082\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_1", "arguments": {}}}, {"class_name": "Cropping2D", "config": {"cropping": [[70, 25], [0, 0]], "trainable": true, "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "elu", "nb_row": 5, "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_1", "nb_filter": 24, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "elu", "nb_row": 5, "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_2", "nb_filter": 36, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "elu", "nb_row": 5, "W_regularizer": null, "subsample": [2, 2], "b_constraint": null, "name": "convolution2d_3", "nb_filter": 48, "nb_col": 5, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "elu", "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_4", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "b_regularizer": null, "activation": "elu", "nb_row": 3, "W_regularizer": null, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_5", "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "bias": true, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": 2112, "activation": "elu", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 100}}, {"class_name": "Dense", "config": {"name": "dense_2", "input_dim": 100, "activation": "elu", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 50}}, {"class_name": "Dense", "config": {"name": "dense_3", "input_dim": 50, "activation": "elu", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 10}}, {"class_name": "Dense", "config": {"name": "dense_4", "input_dim": 10, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "b_regularizer": null, "bias": true, "output_dim": 1}}], "class_name": "Sequential"}