{"keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>\u0083\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "arguments": {}, "output_shape": null, "trainable": true, "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[70, 25], [0, 0]], "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_1", "b_regularizer": null, "border_mode": "valid", "nb_filter": 24, "activation": "elu", "bias": true, "b_constraint": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "nb_filter": 36, "activation": "elu", "bias": true, "b_constraint": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "nb_filter": 48, "activation": "elu", "bias": true, "b_constraint": null, "trainable": true, "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "activation": "elu", "bias": true, "b_constraint": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "activation": "elu", "bias": true, "b_constraint": null, "trainable": true, "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "output_dim": 100, "bias": true, "b_constraint": null, "trainable": true, "activation": "elu", "W_regularizer": null, "init": "glorot_uniform", "input_dim": 2112, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "output_dim": 50, "bias": true, "b_constraint": null, "trainable": true, "activation": "elu", "W_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_regularizer": null, "output_dim": 10, "bias": true, "b_constraint": null, "trainable": true, "activation": "elu", "W_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "activity_regularizer": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_regularizer": null, "output_dim": 1, "bias": true, "b_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null, "init": "glorot_uniform", "input_dim": 10, "activity_regularizer": null, "W_constraint": null}}], "class_name": "Sequential"}