{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bclone.py\u00da\b<lambda>\u0083\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "arguments": {}, "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[70, 25], [0, 0]], "name": "cropping2d_1"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "border_mode": "valid", "nb_row": 5, "nb_col": 5, "W_constraint": null, "bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_filter": 24, "activation": "elu", "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "border_mode": "valid", "nb_row": 5, "nb_col": 5, "W_constraint": null, "bias": true, "name": "convolution2d_2", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_filter": 36, "activation": "elu", "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "border_mode": "valid", "nb_row": 5, "nb_col": 5, "W_constraint": null, "bias": true, "name": "convolution2d_3", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_filter": 48, "activation": "elu", "b_constraint": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "W_constraint": null, "bias": true, "name": "convolution2d_4", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_filter": 64, "activation": "elu", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "border_mode": "valid", "nb_row": 3, "nb_col": 3, "W_constraint": null, "bias": true, "name": "convolution2d_5", "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "trainable": true, "activity_regularizer": null, "nb_filter": 64, "activation": "elu", "b_constraint": null, "subsample": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 100, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "trainable": true, "input_dim": 2112, "activation": "elu", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "trainable": true, "input_dim": 100, "activation": "elu", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "trainable": true, "input_dim": 50, "activation": "elu", "b_constraint": null, "W_constraint": null}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "trainable": true, "input_dim": 10, "activation": "linear", "b_constraint": null, "W_constraint": null}}]}